app/controllers/temp_controller_controller.rb

  def showRooms
    @room1Current= TempLog.where(room:'room1').last
    @room2Current= TempLog.where(room:'room2').last
    @room3Current= TempLog.where(room:'room3').last
    @room4Current= TempLog.where(room:'room4').last
    @room1Temp = SetTemp.where(room:'room1')
---
SELECT "temp_logs".* FROM "temp_logs" WHERE "temp_logs"."room" = 'room1' ORDER BY "temp_logs"."id" DESC LIMIT 1
SELECT "set_temps".* FROM "set_temps" WHERE "set_temps"."room" = 'room1' ORDER BY "set_temps"."id" DESC LIMIT 1