app/controllers/temp_controller_controller.rb

SELECT "set_temps".* FROM "set_temps" WHERE "set_temps"."room" = 'room2'
SELECT 1 AS one FROM "set_temps" WHERE "set_temps"."room" = 'room2' LIMIT 1
---
  def getTemp
    if SetTemp.exists?(room:params[:data])

INSERT INTO "temp_logs" ("created_at", "reading", "room", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 Apr 2014 22:11:44 UTC +00:00], ["reading", #<BigDecimal:217e358,'0.32E2',9(36)>], ["room", "room1"], ["updated_at", Tue, 22 Apr 2014 22:11:44 UTC +00:00]]
---
  def logTemp
    roomData = params[:data]
    roomNo = 'room' + roomData[0]

    TempLog.create(room:roomNo, reading: roomData[1].to_f)

SELECT "temp_logs".* FROM "temp_logs" WHERE "temp_logs"."room" = 'room'
---
  def roomLogs
    @roomNo = params[:room]
    @roomRecords = TempLog.where(room: "room#{@roomNo}")

SELECT "temp_logs"."updated_at" FROM "temp_logs" WHERE "temp_logs"."room" = 'room1'
---
  def roomsGraph
    roomRecords1 = TempLog.where(room: 'room1').pluck(:reading).collect { |x| x.to_f }

SELECT "temp_logs".* FROM "temp_logs" WHERE "temp_logs"."room" = 'room1'
---
  def xlFile
    begin
      # send_file '/home/louis/Desktop/Room_Temp_Logs.xls'
      populateExcel()
      send_file Rails.root.join('excel/Room_Temp_Logs.xls')